# Задача-1: Поработайте с переменными, создайте несколько, выведите на экран,
# Запросить у пользователя несколько чисел и строк и сохранить в переменные, вывести на экран.

a = input("Enter your name: ")
b = int(input("Enter your age: "))
c = float(input("Enter any number: "))

print(a, b, c)